In [38]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [39]:
import pandas as pd

In [40]:
df = pd.DataFrame(people)

In [41]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [43]:
df["full_name"] = df["first"] + " " + df["last"]

In [44]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [45]:
df.drop(columns = ["first","last"], inplace=True)

In [46]:
df["full_name"].str.split(" ", expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [47]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand = True)

In [48]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [49]:
df.append({"first":"Tony"},ignore_index=True)

C:\Users\subhp\AppData\Local\Temp\ipykernel_17744\3818590352.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Tony"},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [50]:
people = {
    'first': ['Tony', 'Steve', ], 
    'last': ['Stark', 'Rogers', ], 
    'email': ['ironman@avenge.com', 'cap@avenge.com', ]
}

df2 = pd.DataFrame(people)

In [51]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [57]:
df.append(df2, ignore_index=True)

C:\Users\subhp\AppData\Local\Temp\ipykernel_17744\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       ironman@avenge.com     Tony Stark   Tony    Stark
4           cap@avenge.com   Steve Rogers  Steve   Rogers

In [55]:
df2["full_name"] = df2["first"] + " " + df2["last"]

In [56]:
df2

   first    last               email     full_name
0   Tony   Stark  ironman@avenge.com    Tony Stark
1  Steve  Rogers      cap@avenge.com  Steve Rogers